stm32duino/Arduino_Core_STM32/boards.txt
# DEMO_F030F4_16M board
GenF0.menu.pnum.DEMO_F030F4_16M=STM32F030F4 Demo board (HSE 16Mhz)
GenF0.menu.pnum.DEMO_F030F4_16M.upload.maximum_size=16384
GenF0.menu.pnum.DEMO_F030F4_16M.upload.maximum_data_size=4096
GenF0.menu.pnum.DEMO_F030F4_16M.build.board=DEMO_F030F4_16M
GenF0.menu.pnum.DEMO_F030F4_16M.build.product_line=STM32F030x6
GenF0.menu.pnum.DEMO_F030F4_16M.build.variant=STM32F0xx/F030F4P
GenF0.menu.pnum.DEMO_F030F4_16M.build.variant_h=variant_DEMO_F030F4.h

# DEMO_F030F4_HSI board
GenF0.menu.pnum.DEMO_F030F4_HSI=STM32F030F4 Demo board (HSI internal RC oscillator)
GenF0.menu.pnum.DEMO_F030F4_HSI.upload.maximum_size=16384
GenF0.menu.pnum.DEMO_F030F4_HSI.upload.maximum_data_size=4096
GenF0.menu.pnum.DEMO_F030F4_HSI.build.board=DEMO_F030F4_HSI
GenF0.menu.pnum.DEMO_F030F4_HSI.build.product_line=STM32F030x6
GenF0.menu.pnum.DEMO_F030F4_HSI.build.variant=STM32F0xx/F030F4P
GenF0.menu.pnum.DEMO_F030F4_HSI.build.variant_h=variant_DEMO_F030F4.h

# Generic F030C8Tx
GenF0.menu.pnum.GENERIC_F030C8TX=Generic F030C8Tx
GenF0.menu.pnum.GENERIC_F030C8TX.upload.maximum_size=65536
GenF0.menu.pnum.GENERIC_F030C8TX.upload.maximum_data_size=8192
GenF0.menu.pnum.GENERIC_F030C8TX.build.board=GENERIC_F030C8TX
GenF0.menu.pnum.GENERIC_F030C8TX.build.product_line=STM32F030x8
GenF0.menu.pnum.GENERIC_F030C8TX.build.variant=STM32F0xx/F030C8T

# Generic F030F4Px
GenF0.menu.pnum.GENERIC_F030F4PX=Generic F030F4Px
GenF0.menu.pnum.GENERIC_F030F4PX.upload.maximum_size=16384
GenF0.menu.pnum.GENERIC_F030F4PX.upload.maximum_data_size=4096
GenF0.menu.pnum.GENERIC_F030F4PX.build.board=GENERIC_F030F4PX
GenF0.menu.pnum.GENERIC_F030F4PX.build.product_line=STM32F030x6
GenF0.menu.pnum.GENERIC_F030F4PX.build.variant=STM32F0xx/F030F4P

# Generic F030R8Tx
GenF0.menu.pnum.GENERIC_F030R8TX=Generic F030R8Tx
GenF0.menu.pnum.GENERIC_F030R8TX.upload.maximum_size=65536
GenF0.menu.pnum.GENERIC_F030R8TX.upload.maximum_data_size=8192
GenF0.menu.pnum.GENERIC_F030R8TX.build.board=GENERIC_F030R8TX
GenF0.menu.pnum.GENERIC_F030R8TX.build.product_line=STM32F030x8
GenF0.menu.pnum.GENERIC_F030R8TX.build.variant=STM32F0xx/F030R8T

# Generic F031K6Tx
GenF0.menu.pnum.GENERIC_F031K6TX=Generic F031K6Tx
GenF0.menu.pnum.GENERIC_F031K6TX.upload.maximum_size=32768
GenF0.menu.pnum.GENERIC_F031K6TX.upload.maximum_data_size=4096
GenF0.menu.pnum.GENERIC_F031K6TX.build.board=GENERIC_F031K6TX
GenF0.menu.pnum.GENERIC_F031K6TX.build.product_line=STM32F031x6
GenF0.menu.pnum.GENERIC_F031K6TX.build.variant=STM32F0xx/F031K6T

# Generic F042C4Tx
GenF0.menu.pnum.GENERIC_F042C4TX=Generic F042C4Tx
GenF0.menu.pnum.GENERIC_F042C4TX.upload.maximum_size=16384
GenF0.menu.pnum.GENERIC_F042C4TX.upload.maximum_data_size=6144
GenF0.menu.pnum.GENERIC_F042C4TX.build.board=GENERIC_F042C4TX
GenF0.menu.pnum.GENERIC_F042C4TX.build.product_line=STM32F042x6
GenF0.menu.pnum.GENERIC_F042C4TX.build.variant=STM32F0xx/F042C(4-6)(T-U)

# Generic F042C6Tx
GenF0.menu.pnum.GENERIC_F042C6TX=Generic F042C6Tx
GenF0.menu.pnum.GENERIC_F042C6TX.upload.maximum_size=32768
GenF0.menu.pnum.GENERIC_F042C6TX.upload.maximum_data_size=6144
GenF0.menu.pnum.GENERIC_F042C6TX.build.board=GENERIC_F042C6TX
GenF0.menu.pnum.GENERIC_F042C6TX.build.product_line=STM32F042x6
GenF0.menu.pnum.GENERIC_F042C6TX.build.variant=STM32F0xx/F042C(4-6)(T-U)

# Generic F042C4Ux
GenF0.menu.pnum.GENERIC_F042C4UX=Generic F042C4Ux
GenF0.menu.pnum.GENERIC_F042C4UX.upload.maximum_size=16384
GenF0.menu.pnum.GENERIC_F042C4UX.upload.maximum_data_size=6144
GenF0.menu.pnum.GENERIC_F042C4UX.build.board=GENERIC_F042C4UX
GenF0.menu.pnum.GENERIC_F042C4UX.build.product_line=STM32F042x6
GenF0.menu.pnum.GENERIC_F042C4UX.build.variant=STM32F0xx/F042C(4-6)(T-U)

# Generic F042C6Ux
GenF0.menu.pnum.GENERIC_F042C6UX=Generic F042C6Ux
GenF0.menu.pnum.GENERIC_F042C6UX.upload.maximum_size=32768
GenF0.menu.pnum.GENERIC_F042C6UX.upload.maximum_data_size=6144
GenF0.menu.pnum.GENERIC_F042C6UX.build.board=GENERIC_F042C6UX
GenF0.menu.pnum.GENERIC_F042C6UX.build.product_line=STM32F042x6
GenF0.menu.pnum.GENERIC_F042C6UX.build.variant=STM32F0xx/F042C(4-6)(T-U)

# Generic F042K4Tx
GenF0.menu.pnum.GENERIC_F042K4TX=Generic F042K4Tx
GenF0.menu.pnum.GENERIC_F042K4TX.upload.maximum_size=16384
GenF0.menu.pnum.GENERIC_F042K4TX.upload.maximum_data_size=6144
GenF0.menu.pnum.GENERIC_F042K4TX.build.board=GENERIC_F042K4TX
GenF0.menu.pnum.GENERIC_F042K4TX.build.product_line=STM32F042x6
GenF0.menu.pnum.GENERIC_F042K4TX.build.variant=STM32F0xx/F042K(4-6)T

# Generic F042K6Tx
GenF0.menu.pnum.GENERIC_F042K6TX=Generic F042K6Tx
GenF0.menu.pnum.GENERIC_F042K6TX.upload.maximum_size=32768
GenF0.menu.pnum.GENERIC_F042K6TX.upload.maximum_data_size=6144
GenF0.menu.pnum.GENERIC_F042K6TX.build.board=GENERIC_F042K6TX
GenF0.menu.pnum.GENERIC_F042K6TX.build.product_line=STM32F042x6
GenF0.menu.pnum.GENERIC_F042K6TX.build.variant=STM32F0xx/F042K(4-6)T

# Generic F051K6Ux
GenF0.menu.pnum.GENERIC_F051K6UX=Generic F051K6Ux
GenF0.menu.pnum.GENERIC_F051K6UX.upload.maximum_size=32768
GenF0.menu.pnum.GENERIC_F051K6UX.upload.maximum_data_size=8192
GenF0.menu.pnum.GENERIC_F051K6UX.build.board=GENERIC_F051K6UX
GenF0.menu.pnum.GENERIC_F051K6UX.build.product_line=STM32F051x8
GenF0.menu.pnum.GENERIC_F051K6UX.build.variant=STM32F0xx/F051K(6-8)U

# Generic F051K8Ux
GenF0.menu.pnum.GENERIC_F051K8UX=Generic F051K8Ux
GenF0.menu.pnum.GENERIC_F051K8UX.upload.maximum_size=65536
GenF0.menu.pnum.GENERIC_F051K8UX.upload.maximum_data_size=8192
GenF0.menu.pnum.GENERIC_F051K8UX.build.board=GENERIC_F051K8UX
GenF0.menu.pnum.GENERIC_F051K8UX.build.product_line=STM32F051x8
GenF0.menu.pnum.GENERIC_F051K8UX.build.variant=STM32F0xx/F051K(6-8)U

# Generic F070CBTx
GenF0.menu.pnum.GENERIC_F070CBTX=Generic F070CBTx
GenF0.menu.pnum.GENERIC_F070CBTX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F070CBTX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F070CBTX.build.board=GENERIC_F070CBTX
GenF0.menu.pnum.GENERIC_F070CBTX.build.product_line=STM32F070xB
GenF0.menu.pnum.GENERIC_F070CBTX.build.variant=STM32F0xx/F070CBT

# Generic F070RBTx
GenF0.menu.pnum.GENERIC_F070RBTX=Generic F070RBTx
GenF0.menu.pnum.GENERIC_F070RBTX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F070RBTX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F070RBTX.build.board=GENERIC_F070RBTX
GenF0.menu.pnum.GENERIC_F070RBTX.build.product_line=STM32F070xB
GenF0.menu.pnum.GENERIC_F070RBTX.build.variant=STM32F0xx/F070RBT

# Generic F072C8Tx
GenF0.menu.pnum.GENERIC_F072C8TX=Generic F072C8Tx
GenF0.menu.pnum.GENERIC_F072C8TX.upload.maximum_size=65536
GenF0.menu.pnum.GENERIC_F072C8TX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F072C8TX.build.board=GENERIC_F072C8TX
GenF0.menu.pnum.GENERIC_F072C8TX.build.product_line=STM32F072xB
GenF0.menu.pnum.GENERIC_F072C8TX.build.variant=STM32F0xx/F072C8(T-U)_F072CB(T-U-Y)

