stm32duino/Arduino_Core_STM32/boards.txt
GenF7.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenF7.menu.upload_method.serialMethod.upload.protocol=1
GenF7.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenF7.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenF7.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenF7.menu.upload_method.dfuMethod.upload.protocol=2
GenF7.menu.upload_method.dfuMethod.upload.options=-g
GenF7.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

###############################
# Generic G0
GenG0.name=Generic STM32G0 series

GenG0.build.core=arduino
GenG0.build.board=GenG0
GenG0.build.mcu=cortex-m0plus
GenG0.build.series=STM32G0xx
GenG0.build.cmsis_lib_gcc=arm_cortexM0l_math
GenG0.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -D__CORTEX_SC=0
GenG0.upload.tool.default=stm32CubeProg
GenG0.upload.maximum_size=0
GenG0.upload.maximum_data_size=0

# AGAFIA SG0
GenG0.menu.pnum.AGAFIA_SG0=AGAFIA SG0
GenG0.menu.pnum.AGAFIA_SG0.upload.maximum_size=131072
GenG0.menu.pnum.AGAFIA_SG0.upload.maximum_data_size=36864
GenG0.menu.pnum.AGAFIA_SG0.build.board=AGAFIA_SG0
GenG0.menu.pnum.AGAFIA_SG0.build.product_line=STM32G071xx
GenG0.menu.pnum.AGAFIA_SG0.build.variant=STM32G0xx/G071C(6-8-B)(T-U)_G081CB(T-U)
GenG0.menu.pnum.AGAFIA_SG0.build.variant_h=variant_{build.board}.h

# Aurora One G030K8
GenG0.menu.pnum.AURORA_ONE=Aurora One
GenG0.menu.pnum.AURORA_ONE.upload.maximum_size=65536
GenG0.menu.pnum.AURORA_ONE.upload.maximum_data_size=8192
GenG0.menu.pnum.AURORA_ONE.build.board=AURORA_ONE
GenG0.menu.pnum.AURORA_ONE.build.product_line=STM32G030xx
GenG0.menu.pnum.AURORA_ONE.build.variant=STM32G0xx/G030K(6-8)T
GenG0.menu.pnum.AURORA_ONE.build.variant_h=variant_{build.board}.h

# Generic G030C6Tx
GenG0.menu.pnum.GENERIC_G030C6TX=Generic G030C6Tx
GenG0.menu.pnum.GENERIC_G030C6TX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G030C6TX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G030C6TX.build.board=GENERIC_G030C6TX
GenG0.menu.pnum.GENERIC_G030C6TX.build.product_line=STM32G030xx
GenG0.menu.pnum.GENERIC_G030C6TX.build.variant=STM32G0xx/G030C(6-8)T

# Generic G030C8Tx
GenG0.menu.pnum.GENERIC_G030C8TX=Generic G030C8Tx
GenG0.menu.pnum.GENERIC_G030C8TX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G030C8TX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G030C8TX.build.board=GENERIC_G030C8TX
GenG0.menu.pnum.GENERIC_G030C8TX.build.product_line=STM32G030xx
GenG0.menu.pnum.GENERIC_G030C8TX.build.variant=STM32G0xx/G030C(6-8)T

# Generic G030F6Px
GenG0.menu.pnum.GENERIC_G030F6PX=Generic G030F6Px
GenG0.menu.pnum.GENERIC_G030F6PX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G030F6PX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G030F6PX.build.board=GENERIC_G030F6PX
GenG0.menu.pnum.GENERIC_G030F6PX.build.product_line=STM32G030xx
GenG0.menu.pnum.GENERIC_G030F6PX.build.variant=STM32G0xx/G030F6P

# Generic G030K6Tx
GenG0.menu.pnum.GENERIC_G030K6TX=Generic G030K6Tx
GenG0.menu.pnum.GENERIC_G030K6TX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G030K6TX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G030K6TX.build.board=GENERIC_G030K6TX
GenG0.menu.pnum.GENERIC_G030K6TX.build.product_line=STM32G030xx
GenG0.menu.pnum.GENERIC_G030K6TX.build.variant=STM32G0xx/G030K(6-8)T

# Generic G030K8Tx
GenG0.menu.pnum.GENERIC_G030K8TX=Generic G030K8Tx
GenG0.menu.pnum.GENERIC_G030K8TX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G030K8TX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G030K8TX.build.board=GENERIC_G030K8TX
GenG0.menu.pnum.GENERIC_G030K8TX.build.product_line=STM32G030xx
GenG0.menu.pnum.GENERIC_G030K8TX.build.variant=STM32G0xx/G030K(6-8)T

# Generic G031J4Mx
GenG0.menu.pnum.GENERIC_G031J4MX=Generic G031J4Mx
GenG0.menu.pnum.GENERIC_G031J4MX.upload.maximum_size=16384
GenG0.menu.pnum.GENERIC_G031J4MX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031J4MX.build.board=GENERIC_G031J4MX
GenG0.menu.pnum.GENERIC_G031J4MX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031J4MX.build.variant=STM32G0xx/G031J(4-6)M_G041J6M

# Generic G031J6Mx
GenG0.menu.pnum.GENERIC_G031J6MX=Generic G031J6Mx
GenG0.menu.pnum.GENERIC_G031J6MX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G031J6MX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031J6MX.build.board=GENERIC_G031J6MX
GenG0.menu.pnum.GENERIC_G031J6MX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031J6MX.build.variant=STM32G0xx/G031J(4-6)M_G041J6M

# Generic G031F4Px
GenG0.menu.pnum.GENERIC_G031F4PX=Generic G031F4Px
GenG0.menu.pnum.GENERIC_G031F4PX.upload.maximum_size=16384
GenG0.menu.pnum.GENERIC_G031F4PX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031F4PX.build.board=GENERIC_G031F4PX
GenG0.menu.pnum.GENERIC_G031F4PX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031F4PX.build.variant=STM32G0xx/G031F(4-6-8)P_G031Y8Y_G041F(6-8)P_G041Y8Y

# Generic G031F6Px
GenG0.menu.pnum.GENERIC_G031F6PX=Generic G031F6Px
GenG0.menu.pnum.GENERIC_G031F6PX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G031F6PX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031F6PX.build.board=GENERIC_G031F6PX
GenG0.menu.pnum.GENERIC_G031F6PX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031F6PX.build.variant=STM32G0xx/G031F(4-6-8)P_G031Y8Y_G041F(6-8)P_G041Y8Y

# Generic G031F8Px
GenG0.menu.pnum.GENERIC_G031F8PX=Generic G031F8Px
GenG0.menu.pnum.GENERIC_G031F8PX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G031F8PX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031F8PX.build.board=GENERIC_G031F8PX
GenG0.menu.pnum.GENERIC_G031F8PX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031F8PX.build.variant=STM32G0xx/G031F(4-6-8)P_G031Y8Y_G041F(6-8)P_G041Y8Y

# Generic G031Y8Yx
GenG0.menu.pnum.GENERIC_G031Y8YX=Generic G031Y8Yx
GenG0.menu.pnum.GENERIC_G031Y8YX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G031Y8YX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031Y8YX.build.board=GENERIC_G031Y8YX
GenG0.menu.pnum.GENERIC_G031Y8YX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031Y8YX.build.variant=STM32G0xx/G031F(4-6-8)P_G031Y8Y_G041F(6-8)P_G041Y8Y

# Generic G031K4Tx
GenG0.menu.pnum.GENERIC_G031K4TX=Generic G031K4Tx
GenG0.menu.pnum.GENERIC_G031K4TX.upload.maximum_size=16384
GenG0.menu.pnum.GENERIC_G031K4TX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031K4TX.build.board=GENERIC_G031K4TX
GenG0.menu.pnum.GENERIC_G031K4TX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031K4TX.build.variant=STM32G0xx/G031K(4-6-8)(T-U)_G041K(6-8)(T-U)

# Generic G031K6Tx
GenG0.menu.pnum.GENERIC_G031K6TX=Generic G031K6Tx
GenG0.menu.pnum.GENERIC_G031K6TX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G031K6TX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031K6TX.build.board=GENERIC_G031K6TX
GenG0.menu.pnum.GENERIC_G031K6TX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031K6TX.build.variant=STM32G0xx/G031K(4-6-8)(T-U)_G041K(6-8)(T-U)

# Generic G031K8Tx
GenG0.menu.pnum.GENERIC_G031K8TX=Generic G031K8Tx
GenG0.menu.pnum.GENERIC_G031K8TX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G031K8TX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031K8TX.build.board=GENERIC_G031K8TX
GenG0.menu.pnum.GENERIC_G031K8TX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031K8TX.build.variant=STM32G0xx/G031K(4-6-8)(T-U)_G041K(6-8)(T-U)

