stm32duino/Arduino_Core_STM32/boards.txt
# Generic G071C8Tx
GenG0.menu.pnum.GENERIC_G071C8TX=Generic G071C8Tx
GenG0.menu.pnum.GENERIC_G071C8TX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G071C8TX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071C8TX.build.board=GENERIC_G071C8TX
GenG0.menu.pnum.GENERIC_G071C8TX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071C8TX.build.variant=STM32G0xx/G071C(6-8-B)(T-U)_G081CB(T-U)

# Generic G071CBTx
GenG0.menu.pnum.GENERIC_G071CBTX=Generic G071CBTx
GenG0.menu.pnum.GENERIC_G071CBTX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G071CBTX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071CBTX.build.board=GENERIC_G071CBTX
GenG0.menu.pnum.GENERIC_G071CBTX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071CBTX.build.variant=STM32G0xx/G071C(6-8-B)(T-U)_G081CB(T-U)

# Generic G071C6Ux
GenG0.menu.pnum.GENERIC_G071C6UX=Generic G071C6Ux
GenG0.menu.pnum.GENERIC_G071C6UX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G071C6UX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071C6UX.build.board=GENERIC_G071C6UX
GenG0.menu.pnum.GENERIC_G071C6UX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071C6UX.build.variant=STM32G0xx/G071C(6-8-B)(T-U)_G081CB(T-U)

# Generic G071C8Ux
GenG0.menu.pnum.GENERIC_G071C8UX=Generic G071C8Ux
GenG0.menu.pnum.GENERIC_G071C8UX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G071C8UX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071C8UX.build.board=GENERIC_G071C8UX
GenG0.menu.pnum.GENERIC_G071C8UX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071C8UX.build.variant=STM32G0xx/G071C(6-8-B)(T-U)_G081CB(T-U)

# Generic G071CBUx
GenG0.menu.pnum.GENERIC_G071CBUX=Generic G071CBUx
GenG0.menu.pnum.GENERIC_G071CBUX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G071CBUX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071CBUX.build.board=GENERIC_G071CBUX
GenG0.menu.pnum.GENERIC_G071CBUX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071CBUX.build.variant=STM32G0xx/G071C(6-8-B)(T-U)_G081CB(T-U)

# Generic G071G8UxN
GenG0.menu.pnum.GENERIC_G071G8UXN=Generic G071G8UxN
GenG0.menu.pnum.GENERIC_G071G8UXN.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G071G8UXN.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071G8UXN.build.board=GENERIC_G071G8UXN
GenG0.menu.pnum.GENERIC_G071G8UXN.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071G8UXN.build.variant=STM32G0xx/G071G(8-B)UxN_G081GBUxN

# Generic G071GBUxN
GenG0.menu.pnum.GENERIC_G071GBUXN=Generic G071GBUxN
GenG0.menu.pnum.GENERIC_G071GBUXN.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G071GBUXN.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071GBUXN.build.board=GENERIC_G071GBUXN
GenG0.menu.pnum.GENERIC_G071GBUXN.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071GBUXN.build.variant=STM32G0xx/G071G(8-B)UxN_G081GBUxN

# Generic G071R6Tx
GenG0.menu.pnum.GENERIC_G071R6TX=Generic G071R6Tx
GenG0.menu.pnum.GENERIC_G071R6TX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G071R6TX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071R6TX.build.board=GENERIC_G071R6TX
GenG0.menu.pnum.GENERIC_G071R6TX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071R6TX.build.variant=STM32G0xx/G071R(6-8)T_G071RB(I-T)_G081RB(I-T)

# Generic G071R8Tx
GenG0.menu.pnum.GENERIC_G071R8TX=Generic G071R8Tx
GenG0.menu.pnum.GENERIC_G071R8TX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G071R8TX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071R8TX.build.board=GENERIC_G071R8TX
GenG0.menu.pnum.GENERIC_G071R8TX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071R8TX.build.variant=STM32G0xx/G071R(6-8)T_G071RB(I-T)_G081RB(I-T)

# Generic G071RBTx
GenG0.menu.pnum.GENERIC_G071RBTX=Generic G071RBTx
GenG0.menu.pnum.GENERIC_G071RBTX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G071RBTX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071RBTX.build.board=GENERIC_G071RBTX
GenG0.menu.pnum.GENERIC_G071RBTX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071RBTX.build.variant=STM32G0xx/G071R(6-8)T_G071RB(I-T)_G081RB(I-T)

# Generic G071RBIx
GenG0.menu.pnum.GENERIC_G071RBIX=Generic G071RBIx
GenG0.menu.pnum.GENERIC_G071RBIX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G071RBIX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071RBIX.build.board=GENERIC_G071RBIX
GenG0.menu.pnum.GENERIC_G071RBIX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071RBIX.build.variant=STM32G0xx/G071R(6-8)T_G071RB(I-T)_G081RB(I-T)

# Generic G081CBTx
GenG0.menu.pnum.GENERIC_G081CBTX=Generic G081CBTx
GenG0.menu.pnum.GENERIC_G081CBTX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G081CBTX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G081CBTX.build.board=GENERIC_G081CBTX
GenG0.menu.pnum.GENERIC_G081CBTX.build.product_line=STM32G081xx
GenG0.menu.pnum.GENERIC_G081CBTX.build.variant=STM32G0xx/G071C(6-8-B)(T-U)_G081CB(T-U)

# Generic G081CBUx
GenG0.menu.pnum.GENERIC_G081CBUX=Generic G081CBUx
GenG0.menu.pnum.GENERIC_G081CBUX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G081CBUX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G081CBUX.build.board=GENERIC_G081CBUX
GenG0.menu.pnum.GENERIC_G081CBUX.build.product_line=STM32G081xx
GenG0.menu.pnum.GENERIC_G081CBUX.build.variant=STM32G0xx/G071C(6-8-B)(T-U)_G081CB(T-U)

# Generic G081GBUxN
GenG0.menu.pnum.GENERIC_G081GBUXN=Generic G081GBUxN
GenG0.menu.pnum.GENERIC_G081GBUXN.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G081GBUXN.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G081GBUXN.build.board=GENERIC_G081GBUXN
GenG0.menu.pnum.GENERIC_G081GBUXN.build.product_line=STM32G081xx
GenG0.menu.pnum.GENERIC_G081GBUXN.build.variant=STM32G0xx/G071G(8-B)UxN_G081GBUxN

# Generic G081RBIx
GenG0.menu.pnum.GENERIC_G081RBIX=Generic G081RBIx
GenG0.menu.pnum.GENERIC_G081RBIX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G081RBIX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G081RBIX.build.board=GENERIC_G081RBIX
GenG0.menu.pnum.GENERIC_G081RBIX.build.product_line=STM32G081xx
GenG0.menu.pnum.GENERIC_G081RBIX.build.variant=STM32G0xx/G071R(6-8)T_G071RB(I-T)_G081RB(I-T)

# Generic G081RBTx
GenG0.menu.pnum.GENERIC_G081RBTX=Generic G081RBTx
GenG0.menu.pnum.GENERIC_G081RBTX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G081RBTX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G081RBTX.build.board=GENERIC_G081RBTX
GenG0.menu.pnum.GENERIC_G081RBTX.build.product_line=STM32G081xx
GenG0.menu.pnum.GENERIC_G081RBTX.build.variant=STM32G0xx/G071R(6-8)T_G071RB(I-T)_G081RB(I-T)

# Generic G0B1RBTx
GenG0.menu.pnum.GENERIC_G0B1RBTX=Generic G0B1RBTx
GenG0.menu.pnum.GENERIC_G0B1RBTX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G0B1RBTX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1RBTX.build.board=GENERIC_G0B1RBTX
GenG0.menu.pnum.GENERIC_G0B1RBTX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1RBTX.build.variant=STM32G0xx/G0B1R(B-C-E)T_G0C1R(C-E)T

# Generic G0B1RCTx
GenG0.menu.pnum.GENERIC_G0B1RCTX=Generic G0B1RCTx
GenG0.menu.pnum.GENERIC_G0B1RCTX.upload.maximum_size=262144
GenG0.menu.pnum.GENERIC_G0B1RCTX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1RCTX.build.board=GENERIC_G0B1RCTX
GenG0.menu.pnum.GENERIC_G0B1RCTX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1RCTX.build.variant=STM32G0xx/G0B1R(B-C-E)T_G0C1R(C-E)T

# Generic G0B1RETx
GenG0.menu.pnum.GENERIC_G0B1RETX=Generic G0B1RETx
GenG0.menu.pnum.GENERIC_G0B1RETX.upload.maximum_size=524288
GenG0.menu.pnum.GENERIC_G0B1RETX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1RETX.build.board=GENERIC_G0B1RETX
GenG0.menu.pnum.GENERIC_G0B1RETX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1RETX.build.variant=STM32G0xx/G0B1R(B-C-E)T_G0C1R(C-E)T

