stm32duino/Arduino_Core_STM32/boards.txt
# Generic G491RCIx
GenG4.menu.pnum.GENERIC_G491RCIX=Generic G491RCIx
GenG4.menu.pnum.GENERIC_G491RCIX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G491RCIX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G491RCIX.build.board=GENERIC_G491RCIX
GenG4.menu.pnum.GENERIC_G491RCIX.build.product_line=STM32G491xx
GenG4.menu.pnum.GENERIC_G491RCIX.build.variant=STM32G4xx/G491RC(I-T)_G491RE(I-T-Y)_G4A1RE(I-T-Y)

# Generic G491REIx
GenG4.menu.pnum.GENERIC_G491REIX=Generic G491REIx
GenG4.menu.pnum.GENERIC_G491REIX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G491REIX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G491REIX.build.board=GENERIC_G491REIX
GenG4.menu.pnum.GENERIC_G491REIX.build.product_line=STM32G491xx
GenG4.menu.pnum.GENERIC_G491REIX.build.variant=STM32G4xx/G491RC(I-T)_G491RE(I-T-Y)_G4A1RE(I-T-Y)

# Generic G491RCTx
GenG4.menu.pnum.GENERIC_G491RCTX=Generic G491RCTx
GenG4.menu.pnum.GENERIC_G491RCTX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G491RCTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G491RCTX.build.board=GENERIC_G491RCTX
GenG4.menu.pnum.GENERIC_G491RCTX.build.product_line=STM32G491xx
GenG4.menu.pnum.GENERIC_G491RCTX.build.variant=STM32G4xx/G491RC(I-T)_G491RE(I-T-Y)_G4A1RE(I-T-Y)

# Generic G491RETx
GenG4.menu.pnum.GENERIC_G491RETX=Generic G491RETx
GenG4.menu.pnum.GENERIC_G491RETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G491RETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G491RETX.build.board=GENERIC_G491RETX
GenG4.menu.pnum.GENERIC_G491RETX.build.product_line=STM32G491xx
GenG4.menu.pnum.GENERIC_G491RETX.build.variant=STM32G4xx/G491RC(I-T)_G491RE(I-T-Y)_G4A1RE(I-T-Y)

# Generic G491REYx
GenG4.menu.pnum.GENERIC_G491REYX=Generic G491REYx
GenG4.menu.pnum.GENERIC_G491REYX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G491REYX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G491REYX.build.board=GENERIC_G491REYX
GenG4.menu.pnum.GENERIC_G491REYX.build.product_line=STM32G491xx
GenG4.menu.pnum.GENERIC_G491REYX.build.variant=STM32G4xx/G491RC(I-T)_G491RE(I-T-Y)_G4A1RE(I-T-Y)

# Generic G4A1REIx
GenG4.menu.pnum.GENERIC_G4A1REIX=Generic G4A1REIx
GenG4.menu.pnum.GENERIC_G4A1REIX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G4A1REIX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G4A1REIX.build.board=GENERIC_G4A1REIX
GenG4.menu.pnum.GENERIC_G4A1REIX.build.product_line=STM32G4A1xx
GenG4.menu.pnum.GENERIC_G4A1REIX.build.variant=STM32G4xx/G491RC(I-T)_G491RE(I-T-Y)_G4A1RE(I-T-Y)

# Generic G4A1RETx
GenG4.menu.pnum.GENERIC_G4A1RETX=Generic G4A1RETx
GenG4.menu.pnum.GENERIC_G4A1RETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G4A1RETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G4A1RETX.build.board=GENERIC_G4A1RETX
GenG4.menu.pnum.GENERIC_G4A1RETX.build.product_line=STM32G4A1xx
GenG4.menu.pnum.GENERIC_G4A1RETX.build.variant=STM32G4xx/G491RC(I-T)_G491RE(I-T-Y)_G4A1RE(I-T-Y)

# Generic G4A1REYx
GenG4.menu.pnum.GENERIC_G4A1REYX=Generic G4A1REYx
GenG4.menu.pnum.GENERIC_G4A1REYX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G4A1REYX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G4A1REYX.build.board=GENERIC_G4A1REYX
GenG4.menu.pnum.GENERIC_G4A1REYX.build.product_line=STM32G4A1xx
GenG4.menu.pnum.GENERIC_G4A1REYX.build.variant=STM32G4xx/G491RC(I-T)_G491RE(I-T-Y)_G4A1RE(I-T-Y)



# Upload menu
GenG4.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenG4.menu.upload_method.swdMethod.upload.protocol=0
GenG4.menu.upload_method.swdMethod.upload.options=-g
GenG4.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenG4.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenG4.menu.upload_method.serialMethod.upload.protocol=1
GenG4.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenG4.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenG4.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenG4.menu.upload_method.dfuMethod.upload.protocol=2
GenG4.menu.upload_method.dfuMethod.upload.options=-g
GenG4.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Generic H7
GenH7.name=Generic STM32H7 Series

GenH7.build.core=arduino
GenH7.build.board=GenH7
GenH7.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
GenH7.build.cmsis_lib_gcc=arm_cortexM7lfsp_math
GenH7.build.fpu=-mfpu=fpv4-sp-d16
GenH7.build.float-abi=-mfloat-abi=hard
GenH7.build.series=STM32H7xx
GenH7.build.mcu=cortex-m7
GenH7.upload.tool.default=stm32CubeProg
GenH7.upload.maximum_size=0
GenH7.upload.maximum_data_size=0

# Daisy Seed board
GenH7.menu.pnum.DAISY_SEED=Daisy Seed
GenH7.menu.pnum.DAISY_SEED.upload.maximum_size=131072
GenH7.menu.pnum.DAISY_SEED.upload.maximum_data_size=524288
GenH7.menu.pnum.DAISY_SEED.build.board=DAISY_SEED
GenH7.menu.pnum.DAISY_SEED.build.product_line=STM32H750xx
GenH7.menu.pnum.DAISY_SEED.build.variant_h=variant_{build.board}.h
GenH7.menu.pnum.DAISY_SEED.build.variant=STM32H7xx/H742I(G-I)(K-T)_H743I(G-I)(K-T)_H750IB(K-T)_H753II(K-T)
GenH7.menu.pnum.DAISY_SEED.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
GenH7.menu.pnum.DAISY_SEED.build.ldscript=DAISY_SEED.ld

# Daisy Patch SM board
GenH7.menu.pnum.DAISY_PATCH_SM=Daisy Patch SM
GenH7.menu.pnum.DAISY_PATCH_SM.upload.maximum_size=131072
GenH7.menu.pnum.DAISY_PATCH_SM.upload.maximum_data_size=524288
GenH7.menu.pnum.DAISY_PATCH_SM.build.board=DAISY_PATCH_SM
GenH7.menu.pnum.DAISY_PATCH_SM.build.product_line=STM32H750xx
GenH7.menu.pnum.DAISY_PATCH_SM.build.variant_h=variant_{build.board}.h
GenH7.menu.pnum.DAISY_PATCH_SM.build.variant=STM32H7xx/H742I(G-I)(K-T)_H743I(G-I)(K-T)_H750IB(K-T)_H753II(K-T)
GenH7.menu.pnum.DAISY_PATCH_SM.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
GenH7.menu.pnum.DAISY_PATCH_SM.build.ldscript=DAISY_SEED.ld

# Daisy Petal SM board
GenH7.menu.pnum.DAISY_PETAL_SM=Daisy Petal SM
GenH7.menu.pnum.DAISY_PETAL_SM.upload.maximum_size=131072
GenH7.menu.pnum.DAISY_PETAL_SM.upload.maximum_data_size=524288
GenH7.menu.pnum.DAISY_PETAL_SM.build.board=DAISY_PETAL_SM
GenH7.menu.pnum.DAISY_PETAL_SM.build.product_line=STM32H750xx
GenH7.menu.pnum.DAISY_PETAL_SM.build.variant_h=variant_{build.board}.h
GenH7.menu.pnum.DAISY_PETAL_SM.build.variant=STM32H7xx/H742I(G-I)(K-T)_H743I(G-I)(K-T)_H750IB(K-T)_H753II(K-T)
GenH7.menu.pnum.DAISY_PETAL_SM.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
GenH7.menu.pnum.DAISY_PETAL_SM.build.ldscript=DAISY_SEED.ld

# DevEBoxH743VITX
GenH7.menu.pnum.DevEBoxH743VITX=DevEBox H743VITX
GenH7.menu.pnum.DevEBoxH743VITX.upload.maximum_size=2097152
GenH7.menu.pnum.DevEBoxH743VITX.upload.maximum_data_size=524288
GenH7.menu.pnum.DevEBoxH743VITX.build.board=DevEBoxH743VITX
GenH7.menu.pnum.DevEBoxH743VITX.build.product_line=STM32H743xx
GenH7.menu.pnum.DevEBoxH743VITX.build.variant=STM32H7xx/H742V(G-I)(H-T)_H743V(G-I)(H-T)_H750VBT_H753VI(H-T)
GenH7.menu.pnum.DevEBoxH743VITX.build.variant_h=variant_DevEBoxH7xx.h
GenH7.menu.pnum.DevEBoxH743VITX.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS

# DevEBoxH750VBTX
GenH7.menu.pnum.DevEBoxH750VBTX=DevEBox H750VBTX
GenH7.menu.pnum.DevEBoxH750VBTX.upload.maximum_size=131072
GenH7.menu.pnum.DevEBoxH750VBTX.upload.maximum_data_size=524288
GenH7.menu.pnum.DevEBoxH750VBTX.build.board=DevEBoxH750VBTX
GenH7.menu.pnum.DevEBoxH750VBTX.build.product_line=STM32H750xx
GenH7.menu.pnum.DevEBoxH750VBTX.build.variant=STM32H7xx/H742V(G-I)(H-T)_H743V(G-I)(H-T)_H750VBT_H753VI(H-T)
GenH7.menu.pnum.DevEBoxH750VBTX.build.variant_h=variant_DevEBoxH7xx.h
GenH7.menu.pnum.DevEBoxH750VBTX.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS

# WeAct MiniSTM32H743VITX
GenH7.menu.pnum.WeActMiniH743VITX=WeAct MiniSTM32H743VITX
GenH7.menu.pnum.WeActMiniH743VITX.upload.maximum_size=2097152
GenH7.menu.pnum.WeActMiniH743VITX.upload.maximum_data_size=524288
GenH7.menu.pnum.WeActMiniH743VITX.build.board=WeActMiniH743VITX
GenH7.menu.pnum.WeActMiniH743VITX.build.product_line=STM32H743xx
GenH7.menu.pnum.WeActMiniH743VITX.build.variant=STM32H7xx/H742V(G-I)(H-T)_H743V(G-I)(H-T)_H750VBT_H753VI(H-T)
GenH7.menu.pnum.WeActMiniH743VITX.build.variant_h=variant_WeActMiniH7xx.h
GenH7.menu.pnum.WeActMiniH743VITX.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS

# WeAct MiniSTM32H750VBTX
GenH7.menu.pnum.WeActMiniH750VBTX=WeAct MiniSTM32H750VBTX
GenH7.menu.pnum.WeActMiniH750VBTX.upload.maximum_size=131072
GenH7.menu.pnum.WeActMiniH750VBTX.upload.maximum_data_size=524288
GenH7.menu.pnum.WeActMiniH750VBTX.build.board=WeActMiniH750VBTX
GenH7.menu.pnum.WeActMiniH750VBTX.build.product_line=STM32H750xx
GenH7.menu.pnum.WeActMiniH750VBTX.build.variant=STM32H7xx/H742V(G-I)(H-T)_H743V(G-I)(H-T)_H750VBT_H753VI(H-T)
GenH7.menu.pnum.WeActMiniH750VBTX.build.variant_h=variant_WeActMiniH7xx.h
GenH7.menu.pnum.WeActMiniH750VBTX.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS

# Generic H742IGKx
GenH7.menu.pnum.GENERIC_H742IGKX=Generic H742IGKx
GenH7.menu.pnum.GENERIC_H742IGKX.upload.maximum_size=1048576
GenH7.menu.pnum.GENERIC_H742IGKX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H742IGKX.build.board=GENERIC_H742IGKX
GenH7.menu.pnum.GENERIC_H742IGKX.build.product_line=STM32H742xx
GenH7.menu.pnum.GENERIC_H742IGKX.build.variant=STM32H7xx/H742I(G-I)(K-T)_H743I(G-I)(K-T)_H750IB(K-T)_H753II(K-T)

# Generic H742IIKx
GenH7.menu.pnum.GENERIC_H742IIKX=Generic H742IIKx
GenH7.menu.pnum.GENERIC_H742IIKX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H742IIKX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H742IIKX.build.board=GENERIC_H742IIKX
GenH7.menu.pnum.GENERIC_H742IIKX.build.product_line=STM32H742xx
GenH7.menu.pnum.GENERIC_H742IIKX.build.variant=STM32H7xx/H742I(G-I)(K-T)_H743I(G-I)(K-T)_H750IB(K-T)_H753II(K-T)

# Generic H742IGTx
GenH7.menu.pnum.GENERIC_H742IGTX=Generic H742IGTx
GenH7.menu.pnum.GENERIC_H742IGTX.upload.maximum_size=1048576
GenH7.menu.pnum.GENERIC_H742IGTX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H742IGTX.build.board=GENERIC_H742IGTX
GenH7.menu.pnum.GENERIC_H742IGTX.build.product_line=STM32H742xx
GenH7.menu.pnum.GENERIC_H742IGTX.build.variant=STM32H7xx/H742I(G-I)(K-T)_H743I(G-I)(K-T)_H750IB(K-T)_H753II(K-T)

# Generic H742IITx
GenH7.menu.pnum.GENERIC_H742IITX=Generic H742IITx
GenH7.menu.pnum.GENERIC_H742IITX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H742IITX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H742IITX.build.board=GENERIC_H742IITX
GenH7.menu.pnum.GENERIC_H742IITX.build.product_line=STM32H742xx
GenH7.menu.pnum.GENERIC_H742IITX.build.variant=STM32H7xx/H742I(G-I)(K-T)_H743I(G-I)(K-T)_H750IB(K-T)_H753II(K-T)

# Generic H742VGHx
GenH7.menu.pnum.GENERIC_H742VGHX=Generic H742VGHx
GenH7.menu.pnum.GENERIC_H742VGHX.upload.maximum_size=1048576
GenH7.menu.pnum.GENERIC_H742VGHX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H742VGHX.build.board=GENERIC_H742VGHX
GenH7.menu.pnum.GENERIC_H742VGHX.build.product_line=STM32H742xx
GenH7.menu.pnum.GENERIC_H742VGHX.build.variant=STM32H7xx/H742V(G-I)(H-T)_H743V(G-I)(H-T)_H750VBT_H753VI(H-T)

# Generic H742VIHx
GenH7.menu.pnum.GENERIC_H742VIHX=Generic H742VIHx
GenH7.menu.pnum.GENERIC_H742VIHX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H742VIHX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H742VIHX.build.board=GENERIC_H742VIHX
GenH7.menu.pnum.GENERIC_H742VIHX.build.product_line=STM32H742xx
GenH7.menu.pnum.GENERIC_H742VIHX.build.variant=STM32H7xx/H742V(G-I)(H-T)_H743V(G-I)(H-T)_H750VBT_H753VI(H-T)

